wsdl/devicemgmt.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/"
                  xmlns:xs="http://www.w3.org/2001/XMLSchema"
                  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
                  targetNamespace="http://www.onvif.org/ver10/device/wsdl">
    <wsdl:types>
        <xs:schema targetNamespace="http://www.onvif.org/ver10/device/wsdl"
                   elementFormDefault="qualified" version="2.4.2">
            <xs:import namespace="http://www.onvif.org/ver10/schema" schemaLocation="onvif.xsd"/>
            <xs:element name="GetServices">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element name="IncludeCapability" type="xs:boolean">
                            <xs:annotation>
                                <xs:documentation>Indicates if the service capabilities should be included in the response.</xs:documentation>
                            </xs:annotation>
                        </xs:element>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="GetServicesResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element name="Service" type="tds:Service" maxOccurs="unbounded">
                            <xs:annotation>
                                <xs:documentation>Each Service element contains information about one service.</xs:documentation>
                            </xs:annotation>
                        </xs:element>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
    </wsdl:types>
    <wsdl:portType name="Device">
        <wsdl:operation name="GetServices">
            <wsdl:documentation>Returns the services supported by the device.</wsdl:documentation>
            <wsdl:input message="tds:GetServicesRequest"/>
            <wsdl:output message="tds:GetServicesResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="DeviceBinding" type="tds:Device">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="GetServices">
            <soap:operation soapAction="http://www.onvif.org/ver10/device/wsdl/GetServices"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
</wsdl:definitions>
