examples/acc_unv_192_168_1_104/device/GetServices.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:tns1="http://www.onvif.org/ver10/topics"
	xmlns:wsa="http://www.w3.org/2005/08/addressing"
	xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:ter="http://www.onvif.org/ver10/error"
	xmlns:tavg="http://www.avigilon.com/onvif/ver10/avigilon-types"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
	xmlns:xmime="http://www.w3.org/2005/05/xmlmime"
	xmlns:xop="http://www.w3.org/2004/08/xop/include"
	xmlns:msianasens="http://www.motorolasolutions.com/onvif/analytics/sensor"
	xmlns:msianavid="http://www.motorolasolutions.com/onvif/analytics/video"
	xmlns:msiptz="http://www.motorolasolutions.com/onvif/ptz">
	<SOAP-ENV:Header></SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tds:GetServices>
			<tds:IncludeCapability>false</tds:IncludeCapability>
		</tds:GetServices>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>