crossref/scenarios/device_get_services.request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header><!--WSSE--></s:Header>
  <s:Body>
    <tds:GetServices xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
      <tds:IncludeCapability>false</tds:IncludeCapability>
    </tds:GetServices>
  </s:Body>
</s:Envelope>
